MAIN_PAGE_GET = {
    'tags': ['뉴스'],
    'description': '메인 페이지 뉴스 리스트',
    'responses': {
        '200': {
            'description': '반환할 뉴스 데이터 있음',
            'examples': {
                'application/json': {
                    "hot_issue": [
                        {
                            "id": "59fdf5b1675180334c4f95b9",
                            "title": "트럼프 순방 동선 따르면 亞 권력지도 보인다",
                            "description": "트럼프 순방 동선 따르면 亞 권력지도 보인다 [뉴스리뷰] [앵커] 도널드 트럼프 미국 대통령이 역대 미 대통령으로는 26년 만에 가장 긴 13일의 아시아 순방 일정에 돌입했습니다. 향후 미국의 아시아 정책 골간을... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b2675180334c4f95ba",
                            "title": "트럼프 방한 찬반집회… '오지마'vs'한미동맹 강화'",
                            "description": "[트럼프 美대통령 7일 방한 앞두고 4일 서울 광화문 일대서 양쪽 나란히 집회] 도널드 트럼프 미국 대통령의 방한을 사흘 앞둔 4일 오후 서울 종로구 르메이에르 앞에서 열린 ‘NO 트럼프·NO WAR 범국민대회’에서... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b267518035b846212f",
                            "title": "한·미 공조 강화 의지…정부, 북 은행·지점장 제재 검토",
                            "description": "북한 은행과 지점장 등을 제재 대상으로 특정하는 조치인데, 트럼프 대통령 방한에 즈음해 한·미공조... 실제로 트럼프 대통령이 이번 방한 때 국회 연설 등을 통해 한국의 대북제재 동참을 촉구할 가능성도... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b2675180334c4f95bb",
                            "title": "트럼프가 가장 먼저 찾는 '캠프 험프리스'는 어떤 곳?",
                            "description": "트럼프가 가장 먼저 찾는 '캠프 험프리스'는 어떤 곳? [뉴스리뷰] [앵커] 우리나라를 찾는 도널드 트럼프 미국 대통령의 첫 일정은 경기도 평택의 주한미군 기지 '캠프 험프리스' 방문입니다. 한미 동맹의 상징으로 꼽히는... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b367518035b8462130",
                            "title": "대구촛불 'TK 적폐 청산 아직...촛불은 계속될 것'",
                            "description": "촛불 트럼프 미국 대통령의 방한에 대한 '반대' 목소리가 높았던 다른 지역과는 달리 이번 대구촛불대회에서는 '끝나지 않은 적폐청산'에 대한 목소리가 컸다. 사드(THAAD, 고고도미사일방어체계)기지 인근 소성리 마을... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b3675180334c4f95bc",
                            "title": "25년만의 미 대통령 국빈방문…군 동원해 '특급경호'",
                            "description": "25년만의 미 대통령 국빈방문…군 동원해 '특급경호' [뉴스리뷰] [앵커] 트럼프 대통령의 국빈방문을 앞둔... [기자] 트럼프 대통령은 한국 도착과 동시에 각종 특급의전을 받게 됩니다. 2014년 버락 오바마 전 대통령의... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b3675180334c4f95bd",
                            "title": "트럼프 방한 반대…수천명 “환영하지 않는다”",
                            "description": "NO 트럼프 NO WAR 범국민대회...7-8일 전국 비상행동 정은희 기자 도널드 트럼프 미국 대통령 방한을 앞두고 반대집회가 열렸다. 한국진보연대, 민주노총 등 222개 단체가 연대한 ‘NO트럼프 공동행동’은 4일 오후 서울... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b3675180334c4f95be",
                            "title": "트럼프, 하와이 미 태평양사령부 방문…북핵 논의",
                            "description": "트럼프, 하와이 미 태평양사령부 방문…북핵 논의 [뉴스리뷰] [앵커] 아시아 순방길에 오른 도널드 트럼프 미국 대통령이 본격적인 아시아 방문에 앞서 하와이에 도착했습니다. 트럼프 대통령은 미군 태평양 사령부를... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b367518035b8462131",
                            "title": "트럼프 방한 사흘 앞…'환영 vs 반대' 줄 잇는 집회 신고",
                            "description": "[앵커] 오늘(4일) 서울 도심에서는 트럼프 대통령의 방한을 환영하는 집회와 반대하는 집회가 각각 동시에 열렸습니다. 방한 기간 중에도 반트럼프 집회와 시위가 잇따라 신고돼 있어 정부가 대책마련에... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b3675180334c4f95bf",
                            "title": "아시아 5개국 순방길 오른 트럼프…'북핵 압박' 목표",
                            "description": "[앵커] 트럼프 미국 대통령이 취임 후 처음으로 우리나라를 비롯한 아시아 순방에 나섰습니다. 북핵과... 한동안 잠잠하던 북한은 트럼프 순방을 두고 '패배자의 구걸행각'이라고 비난했습니다. 박창규... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b3675180334c4f95c0",
                            "title": "트럼프 방한 앞두고…'환영' vs '적폐' 찬반 집회",
                            "description": "[뉴스데스크] ◀ 앵커 ▶ 트럼프 대통령의 방한을 앞두고 찬반 집회가 도심 한복판에서 열렸습니다. 보수 단체는 한미동맹 복원을 외치며 트럼프 대통령을 환영했지만 진보 단체들은 종속적 한미동맹이야말로... ",
                            "like_count": 0,
                            "unlike_count": 0
                        }
                    ],
                    "today_trump": [
                        {
                            "id": "59fdf5b1675180334c4f95b9",
                            "title": "트럼프 순방 동선 따르면 亞 권력지도 보인다",
                            "description": "트럼프 순방 동선 따르면 亞 권력지도 보인다 [뉴스리뷰] [앵커] 도널드 트럼프 미국 대통령이 역대 미 대통령으로는 26년 만에 가장 긴 13일의 아시아 순방 일정에 돌입했습니다. 향후 미국의 아시아 정책 골간을... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b2675180334c4f95ba",
                            "title": "트럼프 방한 찬반집회… '오지마'vs'한미동맹 강화'",
                            "description": "[트럼프 美대통령 7일 방한 앞두고 4일 서울 광화문 일대서 양쪽 나란히 집회] 도널드 트럼프 미국 대통령의 방한을 사흘 앞둔 4일 오후 서울 종로구 르메이에르 앞에서 열린 ‘NO 트럼프·NO WAR 범국민대회’에서... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b267518035b846212f",
                            "title": "한·미 공조 강화 의지…정부, 북 은행·지점장 제재 검토",
                            "description": "북한 은행과 지점장 등을 제재 대상으로 특정하는 조치인데, 트럼프 대통령 방한에 즈음해 한·미공조... 실제로 트럼프 대통령이 이번 방한 때 국회 연설 등을 통해 한국의 대북제재 동참을 촉구할 가능성도... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b2675180334c4f95bb",
                            "title": "트럼프가 가장 먼저 찾는 '캠프 험프리스'는 어떤 곳?",
                            "description": "트럼프가 가장 먼저 찾는 '캠프 험프리스'는 어떤 곳? [뉴스리뷰] [앵커] 우리나라를 찾는 도널드 트럼프 미국 대통령의 첫 일정은 경기도 평택의 주한미군 기지 '캠프 험프리스' 방문입니다. 한미 동맹의 상징으로 꼽히는... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b367518035b8462130",
                            "title": "대구촛불 'TK 적폐 청산 아직...촛불은 계속될 것'",
                            "description": "촛불 트럼프 미국 대통령의 방한에 대한 '반대' 목소리가 높았던 다른 지역과는 달리 이번 대구촛불대회에서는 '끝나지 않은 적폐청산'에 대한 목소리가 컸다. 사드(THAAD, 고고도미사일방어체계)기지 인근 소성리 마을... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b3675180334c4f95bc",
                            "title": "25년만의 미 대통령 국빈방문…군 동원해 '특급경호'",
                            "description": "25년만의 미 대통령 국빈방문…군 동원해 '특급경호' [뉴스리뷰] [앵커] 트럼프 대통령의 국빈방문을 앞둔... [기자] 트럼프 대통령은 한국 도착과 동시에 각종 특급의전을 받게 됩니다. 2014년 버락 오바마 전 대통령의... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b3675180334c4f95bd",
                            "title": "트럼프 방한 반대…수천명 “환영하지 않는다”",
                            "description": "NO 트럼프 NO WAR 범국민대회...7-8일 전국 비상행동 정은희 기자 도널드 트럼프 미국 대통령 방한을 앞두고 반대집회가 열렸다. 한국진보연대, 민주노총 등 222개 단체가 연대한 ‘NO트럼프 공동행동’은 4일 오후 서울... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b3675180334c4f95be",
                            "title": "트럼프, 하와이 미 태평양사령부 방문…북핵 논의",
                            "description": "트럼프, 하와이 미 태평양사령부 방문…북핵 논의 [뉴스리뷰] [앵커] 아시아 순방길에 오른 도널드 트럼프 미국 대통령이 본격적인 아시아 방문에 앞서 하와이에 도착했습니다. 트럼프 대통령은 미군 태평양 사령부를... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b367518035b8462131",
                            "title": "트럼프 방한 사흘 앞…'환영 vs 반대' 줄 잇는 집회 신고",
                            "description": "[앵커] 오늘(4일) 서울 도심에서는 트럼프 대통령의 방한을 환영하는 집회와 반대하는 집회가 각각 동시에 열렸습니다. 방한 기간 중에도 반트럼프 집회와 시위가 잇따라 신고돼 있어 정부가 대책마련에... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b3675180334c4f95bf",
                            "title": "아시아 5개국 순방길 오른 트럼프…'북핵 압박' 목표",
                            "description": "[앵커] 트럼프 미국 대통령이 취임 후 처음으로 우리나라를 비롯한 아시아 순방에 나섰습니다. 북핵과... 한동안 잠잠하던 북한은 트럼프 순방을 두고 '패배자의 구걸행각'이라고 비난했습니다. 박창규... ",
                            "like_count": 0,
                            "unlike_count": 0
                        },
                        {
                            "id": "59fdf5b3675180334c4f95c0",
                            "title": "트럼프 방한 앞두고…'환영' vs '적폐' 찬반 집회",
                            "description": "[뉴스데스크] ◀ 앵커 ▶ 트럼프 대통령의 방한을 앞두고 찬반 집회가 도심 한복판에서 열렸습니다. 보수 단체는 한미동맹 복원을 외치며 트럼프 대통령을 환영했지만 진보 단체들은 종속적 한미동맹이야말로... ",
                            "like_count": 0,
                            "unlike_count": 0
                        }
                    ]
                }
            }
        },
        '204': {
            'description': '서버에 뉴스 데이터 없음'
        }
    }
}
